//Написати функцію, яка приймає 1 параметр. з тим, що передали перший раз і т. д. Все це із замиканнями, наприклад:
//sum(3) = 3
//sum(5) = 8
//sum(20) = 28

//========================================================================================================================================

let getAdder = function () { let res = 0; return function(x) { res += x; return res; } };
let sum = getAdder();

console.log (sum(3))
console.log (sum(5))
console.log (sum(20))

//=========================================================================================================================================

// function sum(a) {

// 	return function(b) {
//         let b = 0;
// 	  return a + b; // берёт "a" из внешнего лексического окружения
// 	};
  
//   }

// alert( sum(3)); // 3
// alert( sum(5)); // 4