// Дан масив [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47] Знайти суму та кількість позитивних елементів.
// Знайти мінімальний елемент масиву та його порядковий номер.
// Знайти максимальний елемент масиву та його порядковий номер.
// Визначити кількість негативних елементів.
// Знайти кількість непарних позитивних елементів.
// Знайти кількість парних позитивних елементів.
// Знайти суму парних позитивних елементів.
// Знайти суму непарних позитивних елементів.
// Знайти добуток позитивних елементів.
// Знайти найбільший серед елементів масиву, остальні обнулити.

// let arr = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];

const arr = [16, -37, 54, -4, 72, -56, 47, 4, -16, 25, -37, 46, 4, -51, 27, -63, 4, -54, 76, -4, 12, -35, 4, 47],
    positiveN = [],
    negativeN = [];
for (let i = 0; i < arr.length; i++) {
    arr[i] >= 0 ? positiveN.push(arr[i]) : negativeN.push(arr[i])
}

let sumElement = arr.reduce((sum, elem) => {
    if (elem >= 0) {
        return sum + elem;
    } else {
        return sum;
    }
});

let result = 'Положительные числа: ' + ${ sumElement } +
    ' (количество:' + positiveN.length + ')<br>' +
    'Отрицательные числа: ' + negativeN.join(',') +
    ' (количество: ' + negativeN.length + ')';


document.body.innerHTML = result;
// positiveN.join(',')
//============================================================================

// let arr = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
// let sumElement = arr.reduce((sum, elem)=>{
//     if (elem >= 0) {
//         return sum + elem;
//     } else {
//         return sum;
//     }
// });
// console.log(sumElement);

//==============================================================================

// let arr = [-1 ,-2 ,-3 ,-4 ,-5 , 1 ,  2 , 3 , 4 , 5];
// let positive = arr.filter(elem =>(elem <0))
// console.log(positive.length)
// let negative = arr.filter(elem =>(elem>0))
// console.log(negative.length)

//==============================================================================